phy_test/Mysql_test_result/net_optane_neonsan/test_adjust_args/oltp_insert_100W.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 128 tps: 44537.47 qps: 44537.47 (r/w/o: 0.00/44537.47/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 40064.70 qps: 40064.70 (r/w/o: 0.00/40064.70/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 128 tps: 37480.97 qps: 37480.97 (r/w/o: 0.00/37480.97/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 37190.72 qps: 37190.72 (r/w/o: 0.00/37190.72/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1000000
        other:                           0
        total:                           1000000
    transactions:                        1000000 (40305.68 per sec.)
    queries:                             1000000 (40305.68 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          24.8071s
    total number of events:              1000000

Latency (ms):
         min:                                  0.52
         avg:                                  3.17
         max:                                108.24
         95th percentile:                      7.17
         sum:                            3170205.31

Threads fairness:
    events (avg/stddev):           7812.5000/38.55
    execution time (avg/stddev):   24.7672/0.01