phy_test/Mysql_test_result/net_optane_neonsan/test_adjust_args/oltp_insert_10_256.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 256
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 256 tps: 40706.01 qps: 40706.01 (r/w/o: 0.00/40706.01/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 256 tps: 36779.58 qps: 36779.58 (r/w/o: 0.00/36779.58/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 256 tps: 34472.36 qps: 34472.36 (r/w/o: 0.00/34472.36/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 256 tps: 32081.56 qps: 32081.56 (r/w/o: 0.00/32081.56/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 256 tps: 28631.59 qps: 28631.59 (r/w/o: 0.00/28631.59/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 256 tps: 28815.24 qps: 28815.24 (r/w/o: 0.00/28815.24/0.00) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1007852
        other:                           0
        total:                           1007852
    transactions:                        1007852 (33530.90 per sec.)
    queries:                             1007852 (33530.90 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0538s
    total number of events:              1007852

Latency (ms):
         min:                                  0.56
         avg:                                  7.62
         max:                                121.14
         95th percentile:                     18.28
         sum:                            7680470.42

Threads fairness:
    events (avg/stddev):           3936.9219/38.95
    execution time (avg/stddev):   30.0018/0.01