phy_test/Mysql_test_result/net_optane_neonsan/test_adjust_args/oltp_insert_16_256.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 256
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 256 tps: 40943.02 qps: 40943.02 (r/w/o: 0.00/40943.02/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 256 tps: 37327.56 qps: 37327.56 (r/w/o: 0.00/37327.56/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 256 tps: 32739.39 qps: 32739.39 (r/w/o: 0.00/32739.39/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 256 tps: 31174.42 qps: 31174.42 (r/w/o: 0.00/31174.42/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 256 tps: 29721.08 qps: 29721.08 (r/w/o: 0.00/29721.08/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 256 tps: 29175.97 qps: 29175.97 (r/w/o: 0.00/29175.97/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1005964
        other:                           0
        total:                           1005964
    transactions:                        1005964 (33465.38 per sec.)
    queries:                             1005964 (33465.38 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0562s
    total number of events:              1005964

Latency (ms):
         min:                                  0.56
         avg:                                  7.63
         max:                                318.22
         95th percentile:                     15.83
         sum:                            7680389.74

Threads fairness:
    events (avg/stddev):           3929.5469/31.89
    execution time (avg/stddev):   30.0015/0.01